solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.h
/*
 * Copyright 2024 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_SFDP_H
#define _FSL_SFDP_H

#include "fsl_common.h"

/*!
 * The SFDP strandard defines the structure of the SFDP database within the memory device and methods used to read its
 * data.
 * The SFDP defined header with Parameter ID FF00h and the related Basic Parameter Table is mandatory.
 * This header and table provide basic information for a SPI protocol memory.
 *
 */

/*!
 *
 * In the JESD216D revision are optional special function parameter tables for the JEDEC x4(Quad) eXtended Serial
 * Peripheral Interface(x4 xSPI).
 * New in the JESD216E revision is a description of the Replay Protected Monotonic Counter(RPMC) functionality
 * and also descriptions of the Secure Read and Secure write Packet transfer transactions.
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define SFDP_READ_INST  (0x5A)
#define SFDP_FETCH_INST (0x5B)

#define SFDP_REVISION(major, minor) (((uint16_t)(major) << 8UL) | ((uint16_t)(minor)))

/*!
 * @brief The enumeration of SFDP revision.
 */
typedef enum _sfdp_revsion
{
    kSFDP_JESD216F = SFDP_REVISION(0x01U, 0x0AU), /*!< Version F. */
    kSFDP_JESD216E = SFDP_REVISION(0x01U, 0x09U), /*!< Version E. */
    kSFDP_JESD216D = SFDP_REVISION(0x01U, 0x08U), /*!< Version D. */
    kSFDP_JESD216C = SFDP_REVISION(0x01U, 0x07U), /*!< Version C. */
    kSFDP_JESD216B = SFDP_REVISION(0x01U, 0x06U), /*!< Version B. */
    kSFDP_JESD216A = SFDP_REVISION(0x01U, 0x05U), /*!< Version A. */
    kSFDP_JESD216  = SFDP_REVISION(0x01U, 0x00U), /*!< The version pre A. */
} sfdp_revsion_t;

/*!
 * @brief The enumeration of return type of sfdp parser functions.
 */
typedef enum _sfdp_ret_type
{
    kSFDP_RET_Invalid,              /*!< Invalid input. */
    kSFDP_RET_HardwareIssue,        /*!< Fail due to spi hardare interface. */
    kSFDP_RET_NotImplemented,       /*!< The feature not implemented. */
    kSFDP_RET_ReadCMDNotSupported,  /*!< Read command not supported. */
    kSFDP_RET_EraseCMDNotSupported, /*!< Erase command not supported. */
    kSFDP_RET_RegBitNotSupported,   /*!< Register bit field not supported. */
    kSFDP_RET_OPICMDNotSupported,   /*!< OPI command not supported. */
    kSFDP_RET_Success,              /*!< Success. */
} sfdp_ret_type_t;

/*!
 * @brief The enumeration of sfdp access protocol
 *
 */
typedef enum _sfdp_access_protocol
{
    kSFDP_AccessProtocol240 = 0xF0, /*!< The access protocol 240 */
    kSFDP_AccessProtocol241 = 0xF1, /*!< The access protocol 241 */
    kSFDP_AccessProtocol242 = 0xF2, /*!< The access protocol 242 */
    kSFDP_AccessProtocol243 = 0xF3, /*!< The access protocol 243 */
    kSFDP_AccessProtocol244 = 0xF4, /*!< The access protocol 244 */
    kSFDP_AccessProtocol245 = 0xF5, /*!< The access protocol 245 */
    kSFDP_AccessProtocol246 = 0xF6, /*!< The access protocol 246 */
    kSFDP_AccessProtocol247 = 0xF7, /*!< The access protocol 247 */
    kSFDP_AccessProtocol250 = 0xFA, /*!< The access protocol 250 */
    kSFDP_AccessProtocol251 = 0xFB, /*!< The access protocol 251 */
    kSFDP_AccessProtocol252 = 0xFC, /*!< The access protocol 252 */
    kSFDP_AccessProtocol253 = 0xFD, /*!< The access protocol 253 */
    kSFDP_AccessProtocol254 = 0xFE, /*!< The access protocol 254 */
    kSFDP_AccessProtocol255 = 0xFF, /*!< The access protocol 255 */
} sfdp_access_protocol_t;

/*!
 * @brief The structure of sfdp header, including SFDP signature, revision, number of parameter header, and access
 * protocol.
 */
typedef struct _sfdp_header
{
    uint32_t signature; /*!< "SFDP" in little endian, 0x50444653h */
    uint8_t minorRev;   /*!< SFDP Minor Revision */
    uint8_t majorRev;   /*!< SFDP Major Revision */
    uint8_t nph;        /*!< Number of parameter header, 0-based, 0 indicates 1 parameter header. */
    uint8_t access;     /*!< SFDP access protocol, up to and including JESD216B this field was 0xFF. */
} sfdp_header_t;

/*!
 * @brief The structure of sfdp parameter header, including parameter ID, minor revision, major revision, length, and
 * parameter table pointer.
 *
 */
typedef struct _sfdp_param_header
{
    uint8_t idLsb;       /*!< Parameter ID LSB */
    uint8_t minorRev;    /*!< Parameter minor revision. */
    uint8_t majorRev;    /*!< Parameter major revision. */
    uint8_t len;         /*!< Parameter length in double words. */
    uint32_t ptp : 24U;  /*!< Parameter table pointer(byte address). */
    uint32_t idMsb : 8U; /*!< Parameter ID MSB. */
} sfdp_param_header_t;

#define SFDP_DW1_BLOCK_SECTOR_ERASE_SIZES_MASK  (0x3UL)
#define SFDP_DW1_BLOCK_SECTOR_ERASE_SIZES_SHIFT (0UL)

/*!
 * @brief The enumeration of octal dtr cmd type.
 */
typedef enum _sfdp_octal_dtr_cmd_type
{
    kSFDP_OctalDTRCmdExtensionSameAsCmd    = 0U, /*!< The command extension is same as the command. */
    kSFDP_OctalDTRCmdExtensionInvertCmd    = 1U, /*!< The command extension is the inverse of the command. */
    kSFDP_OctalDTRCmdExtensionReserved     = 2U, /*!< Reserved. */
    kSFDP_OctalDTRCmdExtensionCmdForm16Bit = 3U, /*!< The command and command extension forms a 16 bit command word. */
} sfdp_octal_dtr_cmd_type_t;

/*!
 * @brief The structure of basic flash param table, dw10 to dw16 is added from JESD216A, dw17 to dw20 is added from
 * JESD216C, dw21 to dw23 is added from JESD216F.
 */
typedef struct _sfdp_basic_flash_param_table
{
    uint32_t dw1;  /*!< Uniform 4KB Sectors, write buffer size, volatile status register, fast read support,
                       number of address bytes, DTR(DDR) support.  */
    uint32_t dw2;  /*!< Memory density. */
    uint32_t dw3;  /*!< Fast Read(1s-4s-4s and 1s-1s-4s): wait states, mode bit clocks and instruction. */
    uint32_t dw4;  /*!< Fast Read(1s-1s-2s and 1s-2s-2s): wait states, mode bit clocks and instruction. */
    uint32_t dw5;  /*!< Fast Read(2s-2s-2s and 4s-4s-4s) support. */
    uint32_t dw6;  /*!< Fast Read(2s-2s-2s): wait states, mode bit clocks and instruction. */
    uint32_t dw7;  /*!< Fast Read(4s-4s-4s): wait states, mode bit clocks and instruction. */
    uint32_t dw8;  /*!< Erase type 1 and 2 size and instruction. */
    uint32_t dw9;  /*!< Erase type 3 and 4 size and instruction. */
    uint32_t dw10; /*!< Added in kSFDP_JESD216A, erase type typical erase times and multiplier used to derive
                    max erase times. */
    uint32_t dw11; /*!< Added in kSFDP_JESD216A, chip erase typical time, byte program and page program
                    typical times, page size. */
    uint32_t dw12; /*!< Added in kSFDP_JESD216A, erase,program suspend, resume support, intervals, latency.*/
    uint32_t dw13; /*!< Added in kSFDP_JESD216A, Progam/Erase suspend/resume instructions. */
    uint32_t dw14; /*!< Added in kSFDP_JESD216A, deep power down and status register polling device busy. */
    uint32_t dw15; /*!< Added in kSFDP_JESD216A, hold and WP disable function, Quad Enable requirements, 4s-4s-4s mode
                    enable/disable sequences, 0-4-4 entry/exit methods and support. */
    uint32_t dw16; /*!< Added in kSFDP_JESD216A, 32-bit address entry/exit methods and support, soft reset and rescure
                    sequences, volatile and nonvolatile status register support. */
    uint32_t dw17; /*!< Added in kSFDP_JESD216C, fast read(1s-8s-8s)(1s-1s-8s): wait states,
                        mode bit clocks, instruction */
    uint32_t dw18; /*!< Added in kSFDP_JESD216C, octal commands, byte order, data strobe, JEDEC SPI protocol reset. */
    uint32_t dw19; /*!< Added in kSFDP_JESD216C, octal enable requirements, 8d-8d-8d mode enable/disable sequences,
                    0-8-8 entry/exit methods and support. */
    uint32_t dw20; /*!< Added in kSFDP_JESD216C, maximum operating speeds. */
    uint32_t dw21; /*!< Added in kSFDP_JESD216F, fast read(1s-1d-1d),(1s-2d-2d),(1s-4d-4d), and (4s-4d-4d) support. */
    uint32_t dw22; /*!< Added in kSFDP_JESD216F, fast read(1s-1d-1d) and (1s-2d-2d) wait states, mode bit clocks, and
                    instruction. */
    uint32_t dw23; /*!< Added in kSFDP_JESD216F, fast read(1s-4d-4d) and (4s-4d-4d) wait states, mode bit clocks and
                    instruction. */
} sfdp_basic_flash_param_table_t;

/*!
 * @brief The structure of sector map parameter table.
 *
 * @details The Sector Map Parameter Table identifies the location and size of sectors within the main data array of the
 * flash memory device and identifies which Erase Types are supported by each sector.
 *
 * @note Added in kSFDP_JESD216B
 */
typedef struct _sfdp_sector_map_param_table
{
    uint32_t dw1; /*!< 1st DWORD. */
    uint32_t dw2; /*!< 2nd DWORD. */
} sfdp_sector_map_param_table_t;

/*!
 * @brief The structure of replay protected monotonic counters parameter header and table.
 *
 * @details  The widely supported RPMC functionality has been adopted by JEDEC to control multiple nonvolatile monotonic
 * counters integrated into a serial flash device. RPMC allows cryptographically secure host access to the
 * (typically four) monotonic counters using packets that include a signature. The signature is generated using an
 * HMAC-SHA256 process that guarantees the authenticity of the transferred packet. The details of RPMC functionality
 * are described in a separate JEDEC standard.
 *
 * @note Added in kSFDP_JESD216E
 */
typedef struct _sfdp_rpmc_param_table
{
    struct
    {
        uint32_t flashHardening : 1U;     /*!< 0: Supported, 1: Not supported. */
        uint32_t counterSize : 1U;        /*!< 0: monotonic counter size is 32 bits, 1: Reserved. */
        uint32_t busyPollingMethod : 1U;  /*!< 0: Use OP2 Extended status, 1: Use Read status. */
        uint32_t reserved1 : 1U;          /*!< Reserved. */
        uint32_t numCounter : 4U;         /*!< Number of supported counters minus one. */
        uint32_t rpmcPacketWriteCmd : 8U; /*!< RPMC packet WRITE command opcode. */
        uint32_t rpmcPacketReadCmd : 8U;  /*!< RPMC packet READ command opcode. */
        uint32_t updateRate : 4U;         /*!< Rate of update = 5 * (2^(updateRate)) seconds. */
        uint32_t reserved2 : 4U;          /*!< Reserved. */
    } dw1;
    struct
    {
        uint32_t readCounterPollingDelayValue : 5U;       /*!< Read counter polling delay value. */
        uint32_t readCounterPollingDelayUnit : 2U;        /*!< Read counter polling delay unit,
                                                              0: 1us, 1: 16us, 2: 128us, 3: 1ms. */
        uint32_t reserved1 : 1U;                          /*!< Reserved. */

