solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.h
        uint32_t writeCounterPollingShortDelayValue : 5U; /*!< Write counter polling short delay value. */
        uint32_t writeCounterPollingShortDelayUnit : 2U;  /*!< Write counter polling short delay unit,
                                                         0: 1us, 1: 16us, 2: 128us, 3: 1ms. */
        uint32_t reserved2 : 1U;                          /*!< Reserved */

        uint32_t writeCounterPollingLongDelayValue : 5U;  /*!< Write counter polling short delay value. */
        uint32_t writeCounterPollingLongDelayUnit : 2U;   /*!< Write counter polling short delay unit
                                                         0: 1ms, 1: 16ms, 2: 128ms, 3: 1s. */
        uint32_t reserved3 : 1U;                          /*!< Reserved. */

        uint32_t reserved4 : 8U;                          /*!< Reserved. */
    } dw2;
} sfdp_rpmc_param_table_t;

/*!
 * @brief The structure of 4-byte address instruction parameter table.
 *
 * @details Legacy SPI memory devices were limited to 128-Mbits (16-Mbytes) of address space by commands that provided
 * only three bytes (24-bits) of address. Recent SPI memories that exceed 128-Mbits density provide various options
 * for providing 4-bytes (32-bits) of address. One option is the use of commands that always provide 4-bytes of
 * address. These commands in some cases have the same function as legacy 3-byte address commands but use a different
 * instruction to indicate that 4-bytes of address follow the instruction. The 4-byte address instruction special
 * function table indicates which 4-byte address command instructions are supported by the SPI memory. The table also
 * provides the 4-byte address instructions for the four Erase Types defined in 8 th DWORD of the Basic Flash Parameter
 * Table. If a 4-byte address instruction is not supported for an Erase Type, the instruction for that type is shown in
 * the table as FFh.
 * @note Added in kSFDP_JESD216B.
 */
typedef struct _sfdp_4_byte_addr_instruction_param_table
{
    uint32_t dw1; /*!< 1st dword. */
    uint32_t dw2; /*!< 2nd dword. */
} sfdp_4_byte_addr_instruction_param_table_t;

/*!
 * @brief The structure of eXtended serial peripheral interface(xSPI) profile 1.0 parameter table.
 * @note Added in kSFDP_JESD216C
 */
typedef struct _sfdp_xSPI_profile1_param_table
{
    uint32_t dw1; /*!< 1st dword. */
    uint32_t dw2; /*!< 2nd dword. */
    uint32_t dw3; /*!< 3rd dword. */
    uint32_t dw4; /*!< 4th dword. */
    uint32_t dw5; /*!< 5th dword. */
    uint32_t dw6; /*!< 6th dword. */
} sfdp_xSPI_profile1_param_table_t;

/*!
 * @brief The structure of eXtended serial peripheral interface(xSPI) profile 2.0 parameter table.
 * @note Added in kSFDP_JESD216C
 */
typedef struct _sfdp_xSPI_profile2_param_table
{
    uint32_t dw1; /*!< 1st dword. */
    uint32_t dw2; /*!< 2nd dword. */
    uint32_t dw3; /*!< 3rd dword. */
} sfdp_xSPI_profile2_param_table_t;

/*!
 * @brief The status, control, and configuration register map for SPI memory devices.
 * @note Added in kSFDP_JESD216C
 */
typedef struct _sfdp_sccr_param_table
{
    uint32_t dw1;  /*!< Volatile register address offset. */
    uint32_t dw2;  /*!< Non-volatile register address offset. */
    uint32_t dw3;  /*!< Generic addressable Read/Write status/control register command for volatile registers. */
    uint32_t dw4;  /*!< Generic addressable Read/Write status/control register command for volatile registers. */
    uint32_t dw5;  /*!< WIP(write in process). */
    uint32_t dw6;  /*!< WEL(write enable latch). */
    uint32_t dw7;  /*!< Program Error. */
    uint32_t dw8;  /*!< Erase Error. */
    uint32_t dw9;  /*!< Variable dummy cycle settings on volatile register. */
    uint32_t dw10; /*!< Variable dummy cycle settings on non-volatile register. */
    uint32_t dw11; /*!< Variable dummy cycle settings 1. */
    uint32_t dw12; /*!< Variable dummy cycle settings 2. */
    uint32_t dw13; /*!< Variable dummy cycle settings 3. */
    uint32_t dw14; /*!< QPI mode enable volatile. */
    uint32_t dw15; /*!< OPI mode enable non volatile. */
    uint32_t dw16; /*!< Octal mode enable volatile. */
    uint32_t dw17; /*!< Octal mode enable non-volatile. */
    uint32_t dw18; /*!< STR or DTR mode select volatile. */
    uint32_t dw19; /*!< STR or DTR mode select non-volatile. */
    uint32_t dw20; /*!< STR Octal Mode enable volatile. */
    uint32_t dw21; /*!< STR Octal Mode enable non-volatile. */
    uint32_t dw22; /*!< DTR Octal Mode enable volatile. */
    uint32_t dw23; /*!< DTR Octal Mode enable non-volatile. */
    uint32_t dw24; /*!< DPD Status */
    uint32_t dw25; /*!< UDPD status. */
    uint32_t dw26; /*!< Output driver strength volatile. */
    uint32_t dw27; /*!< Output driver strength non-volatile. */
    uint32_t dw28; /*!< Output driver strength control bits patterns. */
} sfdp_sccr_param_table_t;

/*!
 * @brief Status, control and configuration register map for xSPI profile 2.0 memory devices.
 *
 * @details The purpose of the SCCR Map is to provide a host controller with a minimum amount of information to be able
 * to boot a system and load necessary code for the system to run. It is to be expected that the code loaded from the
 * memory device will contain the necessary information required to achieve optimum performance from the device.
 */
typedef struct _sfdp_sccr_profile2_param_table
{
    uint32_t dw1;  /*!< Volatile register address offset. */
    uint32_t dw2;  /*!< Non-volatile register address offset. */
    uint32_t dw3;  /*!< Generic addressable Read/Write Status/Control register commands. */
    uint32_t dw4;  /*!< Program Error. */
    uint32_t dw5;  /*!< Erase Error. */
    uint32_t dw6;  /*!< Variable dummy cycle settings - volatile register. */
    uint32_t dw7;  /*!< Variable dummy cycle settings - non-volatile register. */
    uint32_t dw8;  /*!< Variable dummy cycle settings 1 - bit patterns. */
    uint32_t dw9;  /*!< Variable dummy cycle settings 2 - bit patterns. */
    uint32_t dw10; /*!< Variable dummy cycle settings 3 - bit patterns. */
    uint32_t dw11; /*!< Output driver strength - volatile. */
    uint32_t dw12; /*!< Output driver strength - non-volatile. */
    uint32_t dw13; /*!< Output driver strength control bit patterns. */
} sfdp_sccr_profile2_param_table_t;

/*!
 * @brief The structure of status, control and configuration register map offsets for multi-chip spi memory devices.
 * @details For multi-chip devices, each chip (die) will follow the same Status, Control and Configuration Register Map
 * as described in 6.10. Direct commands are not an option in this case, register bits may only be accessed by a
 * command specifying an address and a register value.
 * @note Added in kSFDP_JESD216C
 */
typedef struct _sfdp_sccr_multi_dies_addr_offset_param_table
{
    uint32_t dw1; /*!< Volatile register address offset for Die1. */
    uint32_t dw2; /*!< Non-Volatile register address offset for Die1. */
    uint32_t dw3; /*!< Volatile register address offset for Die2. */
    uint32_t dw4; /*!< Non-Volatile register address offset for Die2. */
    uint32_t dw5; /*!< Volatile register address offset for Die3. */
    uint32_t dw6; /*!< Non-Volatile register address offset for Die3. */
} sfdp_sccr_multi_dies_addr_offset_param_table_t;

/*!
 * @brief The structure of command sequence to octal parameter table.
 * @note Added in kSFDP_JESD216C
 */
typedef struct _sfdp_command_seq_to_octal_param_table
{
    uint32_t dw1; /*!< 1st dword. */
    uint32_t dw2; /*!< 2nd dword. */
    uint32_t dw3; /*!< 3rd dword. */
    uint32_t dw4; /*!< 4th dword. */
    uint32_t dw5; /*!< 5th dword. */
    uint32_t dw6; /*!< 6th dword. */
    uint32_t dw7; /*!< 7th dword. */
    uint32_t dw8; /*!< 8th dword. */
} sfdp_command_seq_to_octal_param_table_t;

/*!
 * @brief The structure of x4 Quad IO with DS parameter table.
 * @note Added in kSFDP_JESD216D
 */
typedef struct _sfdp_x4_quad_with_DS_param_table
{
    uint32_t dw1; /*!< Command codes used in 4s-4d-4d protocol mode. */
    uint32_t dw2; /*!< Command codes used in 4s-4d-4d protocol mode. */
    uint32_t dw3; /*!< Memory commands supported in 4s-4d-4d protocal mode. */
    uint32_t dw4; /*!< Dummy cycles used for various frequencies. */
    uint32_t dw5; /*!< Dummy cycles used for various frequencies. */
} sfdp_x4_quad_with_DS_param_table_t;

/*!
 * @brief The structure of command sequences to change to Quad DTR(DDR).
 * @note Added in kSFDP_JESD216D
 */
typedef struct _sfdp_command_seq_to_quad_param_table
{
    uint32_t dw1; /*!< 1st dword. */
    uint32_t dw2; /*!< 2nd dword. */
    uint32_t dw3; /*!< 3rd dword. */
    uint32_t dw4; /*!< 4th dword. */
    uint32_t dw5; /*!< 5th dword. */
    uint32_t dw6; /*!< 6th dword. */
    uint32_t dw7; /*!< 7th dword. */
    uint32_t dw8; /*!< 8th dword. */
} sfdp_command_seq_to_quad_param_table_t;

/*!
 * @brief The structure of secure packet read/write parameter table.
 * @note Added in kSFDP_JESD216E.
 */
typedef struct _sfdp_secure_packet_read_write_param_table
{
    uint32_t dw1; /*!< 1st dword. */
    uint32_t dw2; /*!< 2nd dword. */
    uint32_t dw3; /*!< 3rd dword. */
    uint32_t dw4; /*!< 4th dword. */
} sfdp_secure_packet_read_write_param_table;

/*!
 * @brief The enumeration of address mode of serial flash devices.
 */
typedef enum _sfdp_addr_mode
{
    kSFDP_AddrMode_3ByteOnly = 0x0U, /*!< Serial flash device only support 3-byte mode. */
    kSFDP_AddrMode_3Or4Byte  = 0x1U, /*!< Default to 3-byte mode, enters 4-byte mode on command. */
    kSFDP_AddrMode_4ByteOnly = 0x2U, /*!< Defult to 4-byte mode. */
    kSFDP_AddrMode_Reserved  = 0x3U, /*!< Reserved. */
} sfdp_addr_mode_t;

/*!
 * @brief The enumeration of flash data pad number.
 */
typedef enum _sfdp_flash_pad_num
{
    kSFDP_Flash1Pad = 0U, /*!< Data pad number is 1. */
    kSFDP_Flash2Pad = 1U, /*!< Data pad number is 2. */
    kSFDP_Flash4Pad = 2U, /*!< Data pad number is 4. */
    kSFDP_Flash8Pad = 3U, /*!< Data pad number is 8. */
} sfdp_flash_pad_num_t;

#define SFDP_ENCODE_PROTOCOL_TYPE(instrPad, instrDDR, addrPad, addrDDR, dataPad, dataDDR, key) \
    (((uint16_t)(key) << 14U) | ((uint16_t)(dataPad) << 0U) | ((uint16_t)(dataDDR) << 2U) |    \
     ((uint8_t)(addrPad) << 3U) | ((uint16_t)(addrDDR) << 5U) | ((uint8_t)(instrPad) << 6U) |  \
     ((uint16_t)(instrDDR) << 8U))

#define SFDP_DECODE_PROTOCOL_TYPE(protocol)                                    \
    do                                                                         \
    {                                                                          \
        instrPad = (sfdp_flash_pad_num_t)(((uint16_t)protocol & 0xC0U) >> 6U); \
        instrDDR = (((uint16_t)protocol & 0x100U) >> 8U);                      \
        addrPad  = (sfdp_flash_pad_num_t)(((uint16_t)protocol & 0x18U) >> 3U); \
        addrDDR  = (((uint16_t)protocol & 0x20U) >> 5U);                       \
        dataPad  = (sfdp_flash_pad_num_t)((uint16_t)protocol & 0x3);           \
        dataDDR  = (((uint16_t)protocol & 0x4U) >> 2U);                        \
    } while (0)

/*!
 * @brief The enumeration of protocol types.
 *
 * @details Command mode nomenclature used to indicate the number of active pins used for the instruction (A),
 * address (B), and data (C), and the data rate used for each. Data rates(n) can be single (S) and dual (D).
 * At the present time, the only valid Read SFDP command modes are: (1S-1S-1S), (2S-2S-2S), (4S-4S-4S), (4S-4D-4D),
 * and (8D-8D-8D). (4S-4D-4D), and (8D-8D-8D) modes also use a Data Strobe (DS) as part of the communication protocol.
 */
typedef enum _sfdp_protocol_type
{
    kSFDP_Protocol_1s1s1s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash1Pad, 0U, kSFDP_Flash1Pad, 0U, 0U), /*!< The protocol is 1s-1s-1s. */
    kSFDP_Protocol_1s1d1d = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash1Pad, 1U, kSFDP_Flash1Pad, 1U, 0U), /*!< The protocol is 1s-1d-1d. */

    kSFDP_Protocol_1s1s2s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash1Pad, 0U, kSFDP_Flash2Pad, 0U, 1U), /*!< The protocol is 1s-1s-2s. */
    kSFDP_Protocol_1s2s2s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash2Pad, 0U, kSFDP_Flash2Pad, 0U, 1U), /*!< The protocol is 1s-2s-2s. */
    kSFDP_Protocol_1s2d2d = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash2Pad, 1U, kSFDP_Flash2Pad, 1U, 1U), /*!< The protocol is 1s-2d-2d. */
    kSFDP_Protocol_2s2s2s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash2Pad, 0U, kSFDP_Flash2Pad, 0U, kSFDP_Flash2Pad, 0U, 1U), /*!< The protocol is 2s-2s-2s. */

