solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.h
    kSFDP_Protocol_1s1s4s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash1Pad, 0U, kSFDP_Flash4Pad, 0U, 2U), /*!< The protocol is 1s-1s-4s. */
    kSFDP_Protocol_1s4s4s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash4Pad, 0U, kSFDP_Flash4Pad, 0U, 2U), /*!< The protocol is 1s-4s-4s. */
    kSFDP_Protocol_1s4d4d = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash4Pad, 1U, kSFDP_Flash4Pad, 1U, 2U), /*!< The protocol is 1s-4d-4d. */
    kSFDP_Protocol_4s4s4s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash4Pad, 0U, kSFDP_Flash4Pad, 0U, kSFDP_Flash4Pad, 0U, 2U), /*!< The protocol is 4s-4s-4s. */
    kSFDP_Protocol_4s4d4d = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash4Pad, 0U, kSFDP_Flash4Pad, 1U, kSFDP_Flash4Pad, 1U, 2U), /*!< The protocol is 4s-4d-4d. */

    kSFDP_Protocol_1s1s8s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash1Pad, 0U, kSFDP_Flash8Pad, 0U, 3U), /*!< The protocol is 1s-1s-8s. */
    kSFDP_Protocol_1s8s8s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash8Pad, 0U, kSFDP_Flash8Pad, 0U, 3U), /*!< The protocol is 1s-8s-8s. */
    kSFDP_Protocol_1s8d8d = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash1Pad, 0U, kSFDP_Flash8Pad, 1U, kSFDP_Flash8Pad, 1U, 3U), /*!< The protocol is 1s-8d-8d. */
    kSFDP_Protocol_8s8s8s = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash8Pad, 0U, kSFDP_Flash8Pad, 0U, kSFDP_Flash8Pad, 0U, 3U), /*!< The protocol is 8s-8s-8s. */
    kSFDP_Protocol_8d8d8d = SFDP_ENCODE_PROTOCOL_TYPE(
        kSFDP_Flash8Pad, 1U, kSFDP_Flash8Pad, 1U, kSFDP_Flash8Pad, 1U, 3U), /*!< The protocol is 8d-8d-8d. */
} sfdp_protocol_type_t;

#define SFDP_4_BYTE_ADDR_INST_TABLE                                                                              \
    {                                                                                                            \
        0x13U, 0x0CU, 0x0EU, 0x3CU, 0xBCU, 0xBEU, 0xFFU, 0x34U, 0xECU, 0xEEU, 0xFFU, 0xFFU, 0x84U, 0x8EU, 0xFDU, \
            0xFFU, 0xFFU                                                                                         \
    }

/*!
 * @brief The structure of write status command information, including instruction.
 *
 */
typedef struct _sfdp_write_status_cmd_info
{
    uint8_t instruction; /*!< The instruction to write status register. */
} sfdp_write_status_cmd_info_t;

/*!
 * @brief The structure of register bit information.
 *
 */
struct _sfdp_reg_bit_info
{
    uint8_t readInstr;          /*!< Read instrution. */
    uint8_t writeInstr;         /*!< Write instruction. */
    uint8_t dummyCycles;        /*!< Default dummy cycles. */
    bool polarity;              /*!< false: positive, value = 1 means write is in progress,
                                  true: Inverted, value = 0 means write is in progress. */
    uint8_t location;           /*!< Shift of bit field. */
    bool addrFollowCmd;         /*!< If required the address followed command. */
    bool upperHalfWordSelected; /*!< Upper half word or lower half word. */
};

typedef struct _sfdp_reg_bit_info sfdp_wip_bit_info_t;
typedef struct _sfdp_reg_bit_info sfdp_wel_bit_info_t;
typedef struct _sfdp_reg_bit_info sfdp_program_error_bit_info_t;
typedef struct _sfdp_reg_bit_info sfdp_erase_error_bit_info_t;

/*!
 * @brief The structure of variable dummy cycle bit field information.
 *
 */
typedef struct _sfdp_variable_dummy_cycle
{
    uint8_t writeInstr;         /*!< Write instruction. */
    uint8_t readInstr;          /*!< Read instruction. */
    uint8_t dummyCycles;        /*!< Number of dummy cycle used for command. */
    uint8_t location;           /*!< Shift of bit field. */
    bool upperHalfWordSelected; /*!< Upper half word or lower half word. */
    bool addrFollowCmd;         /*!<  If required the address followed command. */
    uint8_t bitFieldWidth;      /*!< Bit field width. */
} sfdp_variable_dummy_cycle_t;

/*!
 * @brief The enumeration of 4-byte address mode enter methods.
 *
 */
typedef enum _sfdp_4_byte_addr_enter_method
{
    kSFDP_4ByteAddrEnterMethod0 = 1U << 0U, /*!< Issue instruction 0xB7h */
    kSFDP_4ByteAddrEnterMethod1 = 1U << 1U, /*!< Issue write enable 0x06h then issue instruction 0xB7h */
    kSFDP_4ByteAddrEnterMethod2 = 1U << 2U, /*!< Read with 0xCB, write instruction is C5h with 1 byte of data. */
    kSFDP_4ByteAddrEnterMethod3 = 1U << 3U, /*!< When MSB is set to "1", 4-byte address mode is active, read with
                                                instruction 0x16h, write instruction is 0x17h with 1 byte of data. */
    kSFDP_4ByteAddrEnterMethod4 = 1U << 4U, /*!< A 16-bit nonvolatile configuration register control 3-byte/4-byte
                                                address mode, read instruction is 0xB5h, Bit[0] controls address mode
                                                [0=3 Byte, 1=4 Byte], write configuration register instruction is
                                                0xB1h, data length is 2 bytes. */
    kSFDP_4ByteAddrEnterMethod5 = 1U << 5U, /*!< Supports dedicated 4-byte address instruction set. */
    kSFDP_4ByteAddrEnterMethod6 = 1U << 6U, /*!< Always operates in 4-byte address mode. */
} sfdp_4_byte_addr_enter_method_t;

/*!
 * @brief The enumeration of 4 byte address mode exit methods.
 *
 */
typedef enum _sfdp_4_byte_addr_exit_method
{
    kSFDP_4ByteAddrExitMethod0 = 1U << 0U, /*!< Issue instruction 0xE9h to exit 4-byte address mode. */
    kSFDP_4ByteAddrExitMethod1 = 1U << 1U, /*!< Issue write enable instruction 0x06, then issue instruction
                                                0xE9h to exit 4-byte address mode. */
    kSFDP_4ByteAddrExitMethod2 = 1U << 2U, /*!< 8-bit volatile extended address register used to defined A[31:24] bits,
                                               read with instruction 0xC8h, write instruction is C5h, data length is 1
                                               byte, return to lowest memory segment by setting A[31:24] to 0x0 and use
                                               3-bte addressing. */
    kSFDP_4ByteAddrExitMethod3 = 1U << 3U, /*!< 8-bit volatile bank register used to define A[30:24] bit, MSB is used
                                               to enable/disable 4-byte address mode, when MSB is cleared to 0, 3-byte
                                               address mode is active and A30:A24 are used to select the active 128Mbit
                                               memory segment, read with instruction 0x16h, write instruction is 0x17h,
                                               data length is 1byte. */
    kSFDP_4ByteAddrExitMethod4 = 1U << 4U, /*!< A 16-bit nonvolatile configuration register control 3-byte/4-byte
                                               address mode, read instruction is 0xB5h, Bit[0] controls address mode
                                               [0=3 Byte, 1=4 Byte], write configuration register instruction is
                                               0xB1h, data length is 2 bytes. */
    kSFDP_4ByteAddrExitMethod5 = 1U << 5U, /*!< Hardware reset. */
    kSFDP_4ByteAddrExitMethod6 = 1U << 6U, /*!< Software reset. */
    kSFDP_4ByteAddrExitMethod7 = 1U << 7U, /*!< Power cycle. */
} sfdp_4_byte_addr_exit_method_t;

/*!
 * @brief The enumeration of policy used to get supported protocol, please refer to @ref sfdp_protocol_type_t.
 */
typedef enum _sfdp_cmd_policy
{
    kSFDP_CmdPolicy_HighestThroughput = 0U, /*!< Use this policy to select the supported read command that result in
                                           highest throughput. */
    kSFDP_CmdPolicy_DdrIO            = 1U,  /*!< Both input and output are in DTR(DDR) mode. */
    kSFDP_CmdPolicy_DdrOutput        = 2U,  /*!< Only output is in DTR(DDR) mode. */
    kSFDP_CmdPolicy_LowestThroughput = 3U,  /*!< Use this policy to select the supported read command that result in
                                           lowest throughput. */

