solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.h
    kSFDP_CmdPolicy_SdrIO     = 4U,         /*!< Both input and output are in STR(SDR) mode. */
    kSFDP_CmdPolicy_SdrOutput = 5U,         /*!< Only output is in STR(SDR) mode. */
} sfdp_cmd_policy_t;
#define SFDP_CMD_POLICY_COUNT (6U)

/*!
 * @brief The structure of read command information, including instruction, dummy cycle, and mode clocks.
 */
typedef struct _sfdp_read_cmd_info
{
    uint8_t instruction; /*!< The read instruction. */
    uint8_t dummyCycle;  /*!< The default dummy cycle of read instruction. */
    uint8_t modeClocks;  /*!< Mode bit clocks. */
} sfdp_read_cmd_info_t;

/*!
 * @brief The structure of chip erase command information, including instruction and typical time to erase whole chip.
 *
 */
typedef struct _sfdp_chip_erase_cmd_info
{
    uint8_t instruction;  /* Instruction to erase whole chip. */
    uint32_t typicalTime; /* Typical time to erase whole chip, the unit is ms. */
} sfdp_chip_erase_cmd_info_t;

/*!
 * @brief The structure of erase command information, including size, instruction and typical time to erase
 * specific size.
 */
typedef struct _sfdp_erase_cmd_info
{
    uint32_t eraseSize;   /*!< Size of memory to erase, the unit is byte. */
    uint8_t instruction;  /*!< Instruction to erase specific size of memory. */
    uint32_t typicalTime; /*!< Typical time to erase specific size of memory, the unit is ms. */
} sfdp_erase_cmd_info_t;

/*!
 * @brief The enumeration of erase command type.
 */
typedef enum _sfdp_erase_cmd_type
{
    kSFDP_EraseCmdType1 = 0U, /*!< Erase command type 1. */
    kSFDP_EraseCmdType2 = 1U, /*!< Erase command type 2. */
    kSFDP_EraseCmdType3 = 2U, /*!< Erase command type 3. */
    kSFDP_EraseCmdType4 = 3U, /*!< Erase command type 4. */
} sfdp_erase_cmd_type_t;

/*!
 * @brief The structure of page program command information, including instruction and typical time to program the
 * specific page.
 *
 */
typedef struct _sfdp_page_program_cmd_info
{
    uint8_t instruction;  /*!< The instruction of page program. */
    uint32_t typicalTime; /*!< Typical time to program page, the unit is us. */
} sfdp_page_program_cmd_info_t;

/*!
 * @brief The structure of read status command information, including instruction, address size a
 *
 */
typedef struct _sfdp_read_status_cmd_info
{
    uint8_t instruction; /*!< The read status instruction. */
    uint8_t addrSize;    /*!< Number of address size for generic addressable read/write
                           status/control register instruction. */
    uint8_t dummyCycle;  /*!< Number of dummy cycle. */
} sfdp_read_status_cmd_info_t;

typedef status_t (*SFDP_SpiReadFunc)(uint32_t address, uint32_t *outputBuffer, uint32_t sizeInBytes);

/*!
 * @brief The enumeration of cmd supported in xspi 1.0 and xspi 2.0 profile.
 *
 */
typedef enum _sfdp_xspi_profile_opi_cmd
{
    kSFDP_OPICmd_ReadSfdp = 0U,        /*!< Read SFDP command. */
    kSFDP_OPICmd_Erase4K,              /*!< Erase 4K command. */
    kSFDP_OPICmd_EraseChip,            /*!< Erase chip command. */
    kSFDP_OPICmd_WriteStatusConfigReg, /*!< Write status configuration register command. */
    kSFDP_OPICmd_ReadConfigReg,        /*!< Read configuration register command. */
    kSFDP_OPICmd_ReadStatusReg,        /*!< Read status register command. */
    kSFDP_OPICmd_WriteStatusReg,       /*!< Write status register command. */
} sfdp_xspi_profile_opi_cmd_t;
#define SFDP_XSPI_PROFILE_OPI_CMD_COUNT (7U)

/*!
 * @brief The enumeration of 0-4-4 mode entry method.
 *
 */
typedef enum _sfdp_044_mode_entry_method
{
    kSFDP_044ModeEntryMethod0 =
        1U << 0U, /*!< Mode Bits[7:0] = A5h, note that QE must be set prior to using this mode. */
    kSFDP_044ModeEntryMethod1 = 1U << 1U, /*!< Read volatile configuration register with instruction 85h, set bit 3(XIP)
                                            in the data read, and write the modified data using the instruction 81h. */
    kSFDP_044ModeEntryMethod2 = 1U << 2U, /*!< Mode Bit[7:0]= AXh */
} sfdp_044_mode_entry_method_t;

/*!
 * @brief The enumeration of 0-4-4 mode exit method.
 *
 */
typedef enum _sfdp_044_mode_exit_method
{
    kSFDP_044ModeExitMethod0 = 1U << 0U, /*!< Mode Bit[7:0] = 00h will terminate 0-4-4 mode
                                            at the end of the current read operation. */
    kSFDP_044ModeExitMethod1 = 1U << 1U, /*!< If 3-byte address active, input Fh in IO0-IO3 for 8 clocks,
                                            if 4-byte address active, input Fh on IO0-IO3 for 10 clocks. */
    kSFDP_044ModeExitMethod2 = 1U << 3U, /*!< Input Fh on IO0-IO3 for 8 clocks. */
    kSFDP_044ModeExitMethod3 = 1U << 4U, /*!< Mode Bit[7:0] != AXh. */
} sfdp_044_mode_exit_method_t;

/*!
 * @brief The enumeration of 0-8-8 mode entry method.
 *
 */
typedef enum _sfdp_088_mode_entry_method
{
    kSFDP_088ModeEntryNotSupported = 0U, /*!< Device does not support 0-8-8 mode. */
    kSFDP_088ModeEntryMethod1      = 1U, /*!< Read the 8-bit volatile configuration register with instruction 85h, set
                                             XIP bit[0] in the data read, and write the modified data using the instruction
                                             81h, then mode bits[7:0] = 01h. */
} sfdp_088_mode_entry_method_t;

/*!
 * @brief The enumeration of 0-8-8 mode exit method.
 *
 */
typedef enum _sfdp_088_mode_exit_method
{
    kSFDP_088ModeExitNotSupported = 0U,  /*!< Device does not support 0-8-8 mode. */
    kSFDP_088ModeExitMethod1 = 1U << 0U, /*!< Mode Bits[7:0] = 00h will terminate this mode at the end of the current
                                        read operation. */
    kSFDP_088ModeExitMethod2 = 1U << 1U, /*!< If 3-byte address active, input FFh on DQ0-DQ7 for 4 clocks, if 4-byte
                                        address active input Fh on DQ0-DQ7 for 5 clocks. */
} sfdp_088_mode_exit_method_t;

/*!
 * @brief The enumeration of 4s-4s-4s mode enable method from 1s-1s-1s mode.
 */
typedef enum _sfdp_4s4s4s_mode_enable_method
{
    kSFDP_4s4s4sModeEnableMethod0 = 1U << 0U, /*!< set QE per QER, then issue instruction 38h. */
    kSFDP_4s4s4sModeEnableMethod1 = 1U << 1U, /*!< Issue instruction 38h. */
    kSFDP_4s4s4sModeEnableMethod2 = 1U << 2U, /*!< Issue instruction 35h. */
    kSFDP_4s4s4sModeEnableMethod3 = 1U << 3U, /*!< Read configuration using instruction 65h followed by address 800003h,
                                                set bit 6, write configuration using instruction 71h followed by
                                                address 800003h. */
    kSFDP_4s4s4sModeEnableMethod4 = 1U << 4U, /*!< Read volatile enhanced configuration using instruction 65h, no
                                                address is required, set bit 7 to 1, write volatile enhanced
                                                configuration using instruction 61h, no address is required. */
} sfdp_4s4s4s_mode_enable_method_t;

/*!
 * @brief The enumeration of 4s-4s-4s mode disable method
 *
 */
typedef enum _sfdp_4s4s4s_mode_disable_method
{
    kSFDP_4s4s4sModeDisableMethod0 = 1U << 0U, /*!< Issue FFh instruction. */
    kSFDP_4s4s4sModeDisableMethod1 = 1U << 1U, /*!< Issue F5h instruction. */
    kSFDP_4s4s4sModeDisableMethod2 = 1U << 2U, /*!< Read configuration using instruction 65h followed by address
                                                800003h, clear bit 6, write configuration using instruction 71h followed
                                                by address 800003h. */
    kSFDP_4s4s4sModeDisableMethod3 = 1U << 3U, /*!< Issue software reset 66/99 sequence. */
    kSFDP_4s4s4sModeDisableMethod4 = 1U << 4U, /* Read volatile enhanced configuration using instruction 65h, no address
                                                is required, clear bit 7, write volatile enhanced configuration using
                                                instruction 61h, no address is required. */
} sfdp_4s4s4s_mode_disable_method_t;

/*!
 * @brief The enumeration of 8s-8s-8s mode enable method from 1s-1s-1s mode.
 *
 */
typedef enum _sfdp_8s8s8s_mode_enable_method
{
    kSFDP_8s8s8sModeEnableMethod0 = 1U << 1U, /*!< Issue instruction 06h, then issue instruction E8h. */
    kSFDP_8s8s8sModeEnableMethod1 = 1U << 2U, /*!< Issue instruction 06h, then issue instruction 72h(address = 0h,
                                               data=01h or 02h). */
} sfdp_8s8s8s_mode_enable_method_t;

/*!
 * @brief The enumeration of 8s-8s-8s mode disable method.
 *
 */
typedef enum _sfdp_8s8s8s_mode_disable_method
{
    kSFDP_8s8s8sModeDisableMethod0 = 1U << 0U, /*!< Issue instruction 06h, then issue FFh instruction. */
    kSFDP_8s8s8sModeDisableMethod1 = 1U << 3U, /*!< Issue the soft reset sequence. */
} sfdp_8s8s8s_mode_disable_method_t;

/*!
 * @brief The structure of erase/suspend resume command information, including suspend instruction, resume
 * instruction, erase maximum latency, resume to suspend interval.
 *
 */
typedef struct _sfdp_erase_suspend_resume_cmd_info
{
    uint8_t suspendInstr;     /*!< Suspend instruction. */
    uint8_t resumeInstr;      /*!< Resume instruction. */
    uint32_t eraseMaxLatency; /*!< Maximum time required by the flash device to suspend an in-progress erase, the unit
                                 is ns.  */
    uint32_t resumeToSuspendInterval; /*!< The interval between the resumed erase operation to another suspend, the unit
                                         is us. */
} sfdp_erase_suspend_resume_cmd_info_t;

/*!
 * @brief The structure of program suspend command information, including suspend instruction, resume instruction,
 * erase maximum latency, resume to suspend interval.
 *
 */
typedef struct _sfdp_program_suspend_cmd_info
{
    uint8_t suspendInstr;     /*!< Suspend instruction. */
    uint8_t resumeInstr;      /*!< Resume instruction. */
    uint32_t eraseMaxLatency; /*!< Maximum time required by the flash device to suspend an in-progress erase, the unit
                                 is ns.  */
    uint32_t resumeToSuspendInterval; /*!< The interval between the resumed erase operation to another suspend, the unit
                                         is us. */
} sfdp_program_suspend_cmd_info_t;

/*!
 * @brief The structure of deep power down command information, including enter/exit instruction, exit deep power down
 * delay.
 *
 */
typedef struct _sfdp_deep_power_down_cmd_info
{
    uint8_t enterDeepPowerDownInstr; /*!< Instruction of enter deep power down mode. */
    uint8_t exitDeepPowerDownInstr;  /*!< Instruction of exit deep power down mode. */
    uint32_t exitDeepPowerDownDelay; /*!< Maximum time required by the flash device to exit deep power down and be
                                        ready to accept any command, the unit is ns. */
} sfdp_deep_power_down_cmd_info_t;

/*!
 * @brief The enumeration of quad enable method, the quad enable bit used to enable 1s-1s-4s and 1s-4s-4s quad read
 * or quad program operations.
 *
 */
typedef enum _sfdp_quad_enable_method
{
    kSFDP_QuadEnableNotSupported = 0U, /*!< Device doest not have a QE bit, device detects 1s-1s-4s and 1s-4s-4s reads
                                       based on instruction. */
    kSFDP_QuadEnableMethod1 = 1U,      /*!< QE is bit 1 of status register 2, it is set via write status with two data
                                         bytes where bit 1 of the second byte is one, it is cleared via write status with two
                                         data bytes where bit 1 of the second byte is zero. */
    kSFDP_QuadEnableMethod2 = 2U, /*!< QE is bit 6 of status register 1, it is set via write status with one data byte
                                    where bit 6 is one, it is cleared via write status with one data byte where bit 6
                                    is zero. */
    kSFDP_QuadEnableMethod3 = 3U, /*!< QE is bit 7 of status register 2, it is set via write status register 2
                                instruction 3Eh with one data byte where bit 7 is one, it is cleared via write status
                                register 2 instruction 3Eh with one data byte where bit 7 is zero, the status register
                                2 is read using instruction 3Fh. */
    kSFDP_QuadEnableMethod4 = 4U, /*!< QE is bit 1 of status register 2, it is set via write status with two data bytes
                                where bit 1 of the second byte is one, it is cleared via write status with two data
                                bytes where bit 1 of the second byte is zero. */
    kSFDP_QuadEnableMethod5 = 5U, /*!< QE is bit 1 of status register 2, using 05h to read status register 1, using 35h
                                to read status register 2, it is set via write status instruction 01h with two data
                                bytes where bit 1 of the second byte is one, it is cleared via write status with two
                                data bytes where bit 1 of the second byte is zero. */
    kSFDP_QuadEnableMethod6 = 6U, /*!< QE is bit 1 of status register 2, using 05h to read status register 1, using 35h
                                to read status register 2, using 15h to read status register 3, it is set via write
                                status instruction 31h with two data bytes where bit 1 of the second byte is one, it is
                                cleared via write status with two data bytes where bit 1 of the second byte is zero. */
} sfdp_quad_enable_method_t;

/*!
 * @brief The enumeration of software reset method.
 *
 */
typedef enum _sfdp_soft_reset_method
{
    kSFDP_SoftResetNotSupported = 0U,       /*!< No software reset instruction is supported. */
    kSFDP_SoftResetMethod1      = 1U << 0U, /*!< Drive Fh on all 4 data wires for 8 clocks. */
    kSFDP_SoftResetMethod2      = 1U << 1U, /*!< Drive Fh on all 4 data wires for 10 clocks if device is operating in
                                            4-byte address mode. */
    kSFDP_SoftResetMethod3 = 1U << 2U,      /*!< Drive Fh on all 4 data wires for 16 clocks. */
    kSFDP_SoftResetMethod4 = 1U << 3U,      /*!< Issue instruction F0h. */
    kSFDP_SoftResetMethod5 = 1U << 4U, /*!< Issue reset enable instruction 66h, then issue reset instruction 99h. */
    kSFDP_SoftResetMethod6 = 1U << 5U, /*!< Issue 0-4-4 mode is required prior to other reset sequence above if the
                                        device may be operating in this mode. */
} sfdp_soft_reset_method_t;

/*!
 * @brief The enumeration of octal enable method, the octal enable bit used to enable 1s-1s-8s and 1s-8s-8s octal read
 * or octal program operations.
 *
 */
typedef enum _sfdp_octal_enable_method
{
    kSFDP_OctalEnableNotSupported = 0U, /*!< Device does not have an octal enable bit. */
    kSFDP_OctalEnableMethod1 = 1U, /*!< Octal enable is bit 3 of status register, it is set via write status register2
                                    instruction 31h with one data byte where bit 3 is one, it is cleared via write
                                    register instruction 3Eh with one data byte where bit 3 is zero, the status
                                    register 2 is read using instruction 65h with address byte 02h and one dummy
                                    cycle. */
} sfdp_octal_enable_method_t;

/*!
 * @brief The structure of octal ddr or quad ddr entry sequence format.
 *
 */
typedef union _sfdp_entry_seq_format
{
    struct
    {
        uint8_t byte3;  /*!< 3rd byte of sequence. */
        uint8_t byte2;  /*!< 2nd byte of sequence. */
        uint8_t byte1;  /*!< 1st byte of sequence. */
        uint8_t length; /*!< length of sequence. */
        uint8_t byte7;  /*!< 7th byte of sequence. */
        uint8_t byte6;  /*!< 6th byte of sequence. */
        uint8_t byte5;  /*!< 5th byte of sequence. */
        uint8_t byte4;  /*!< 4th byte of sequence. */
    } seqStruct;        /*!< The sequence format in structure format. */
    uint64_t seqU64;    /*!< The sequence format in uint64 format. */
} sfdp_entry_seq_format_t;

/*!
 * @brief The structure of 8d-8d-8d(octal ddr) mode entry sequences.
 *
 */
typedef struct _sfdp_8d8d8d_entry_seq
{
    sfdp_entry_seq_format_t seq1; /*!< 1st sequence. */
    sfdp_entry_seq_format_t seq2; /*!< 2nd sequence. */
    sfdp_entry_seq_format_t seq3; /*!< 3rd sequence. */
    sfdp_entry_seq_format_t seq4; /*!< 4th sequence. */
} sfdp_8d8d8d_entry_seq_t;

/*!
 * @brief The macro used to get command in the sequence.
 *     - idx: range from 1 to 7
 *     - seq: The sequence data in type of #sfdp_entry_seq_format_t.
 */
#define SFDP_GET_SEQ_CMD(seq, idx) \
    (uint8_t)(((seq).seqU64 >> (8ULL * (((idx) / 4ULL) * 4ULL + (3ULL - (idx) % 4ULL)))) & 0xFFULL)

/*!
 * @brief The structure of 4s-4d-4d(quad ddr) entry sequence.
 *
 */
typedef struct _sfdp_4s4d4d_entry_seq
{
    sfdp_entry_seq_format_t seq1; /*!< 1st sequence. */
    sfdp_entry_seq_format_t seq2; /*!< 2nd sequence. */
    sfdp_entry_seq_format_t seq3; /*!< 3rd sequence. */
    sfdp_entry_seq_format_t seq4; /*!< 4th sequence. */
} sfdp_4s4d4d_entry_seq_t;

/*!
 * @brief The handle of sfdp, included all sfdp parameter table.
 *
 */
typedef struct _sfdp_handle
{
    sfdp_basic_flash_param_table_t bfp;                               /*!< Basic flash parameter table. */
    sfdp_sector_map_param_table_t sectorMapTable;                     /*!< Sector map parameter table. */
    sfdp_rpmc_param_table_t rpmcTable;                                /*!< Replay protected monotonic counters
                                                                      parameter table. */
    sfdp_4_byte_addr_instruction_param_table_t fourByteAddrInstTable; /*!< 4-byte address instruction
                                                                        parameter table. */
    sfdp_xSPI_profile1_param_table_t xSPIProfile1Table;               /*!< eXtended serial peripheral interface profile
                                                                          1.0 parameter table. */
    sfdp_xSPI_profile2_param_table_t xSPIProfile2Table;               /*!< eXtended serial peripheral interface profile
                                                                          2.0 parameter table. */
    sfdp_sccr_param_table_t SCCRegMapTable;                   /*!< Status, control, and Configuration register map
                                                              for SPI memory devices. */
    sfdp_sccr_profile2_param_table_t SCCRegMapMultiChipTable; /*!< Status, control and configuration register map
                                                          for xSPI profile 2.0 memory devices. */
    sfdp_sccr_multi_dies_addr_offset_param_table_t SCCRegMapxSPIProfile2Table; /*!< Status, control and configuration
                                                           register map offset for multi-chip SPI memory devices. */
    sfdp_command_seq_to_octal_param_table_t cmdSeq2OctalDDR;                   /*!< Command sequences to change to
                                                                               octal DTR(DDR) mode. */
    sfdp_command_seq_to_quad_param_table_t cmdSeq2QuadDDR;                     /*!< Command sequences to change to
                                                                                  Quad DTR(DDR) mode. */
    sfdp_x4_quad_with_DS_param_table_t x4QualIOWithDS;             /*!< x4 Quad IO with DS parameter table. */
    sfdp_secure_packet_read_write_param_table securePacketRWTable; /*!< Secure packet READ/WRITE parameter table. */

    SFDP_SpiReadFunc spiRead;                                      /*!< The function of read sfdp. */
    sfdp_revsion_t curJEDECVersion;                                /*!< JEDEC version of current serial flash device. */
    uint8_t nph;                                                   /* Counts of parameter tables. */
    uint8_t access;            /*!< Current serial flash device's access protocol. */
    sfdp_addr_mode_t addrMode; /*!< Current serial flash device's address mode. */
} sfdp_handle_t;

