solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.h
/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name Read SFDP Data Sets
 * @{
 */

/*!
 * @brief Read SFDP header, and check if SFDP signature is correct.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] spiRead The function to read sfdp header.
 *
 * @retval kSFDP_RET_HardwareIssue Fail to read SFDP header due to some hardware issue.
 * @retval kSFDP_RET_Invalid Fail to read SFDP header due to invalid SFDP signature.
 * @retval kSFDP_RET_Success Successfully to read sfdp header.
 */
sfdp_ret_type_t SFDP_ReadSFDPHeader(sfdp_handle_t *handle, SFDP_SpiReadFunc spiRead);

/*!
 * @brief Read SFDP parameter header.
 *
 * @param[out] ptrSfdpParamHeader Pointer to the variable in type of @ref sfdp_param_header_t
                                to store sfdp parameter header.
 * @param[in] nph Number of parameter header.
 * @param[in] spiRead Function to read sfdp parameter header.
 *
 * @retval kStatus_Success Successfully to read SFDP parameter header.
 * @retval kSFDP_RET_HardwareIssue Fail to read SFDP parameter header due to some hardware issues.
 */
sfdp_ret_type_t SFDP_ReadSFDPParameterHeader(sfdp_param_header_t *ptrSfdpParamHeader,
                                             uint8_t nph,
                                             SFDP_SpiReadFunc spiRead);

/*!
 * @brief Read all current serial flash device supported parameter tables.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval kSFDP_RET_HardwareIssue Fail to read SFDP parameter header due to some hardware issues.
 * @retval kSFDP_RET_Success Successfully to read all supported parameter tables.
 */
sfdp_ret_type_t SFDP_ReadAllSupportedTable(sfdp_handle_t *handle);

/* @} */

/*!
 * @name Get Flash Basic Attributes
 * @{
 */

/*!
 * @brief Get Flash Density, the result in unit of KB.

 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return In unit of KB, 64 means 64KB(512 Kb)
 */
uint32_t SFDP_GetFlashDensity(sfdp_handle_t *handle);

/*!
 * @brief Get page size, the result in unit of Byte.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return The size of page.
 */
uint32_t SFDP_GetPageSize(sfdp_handle_t *handle);

/*!
 * @brief Get flash interface mode based on input policy, and number of data pad.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] cmdPolicy The policy used to select interface mode, in type of @ref sfdp_cmd_policy_t.
 * @param[in] flashPadNum The number of data pad, in type of @ref sfdp_flash_pad_num_t
 *
 * @return Calculated protocol type, in type of @ref sfdp_protocol_type_t.
 */
sfdp_protocol_type_t SFDP_GetFlashProtocolType(sfdp_handle_t *handle,
                                               sfdp_cmd_policy_t cmdPolicy,
                                               sfdp_flash_pad_num_t flashPadNum);

/*!
 * @brief Check if DTR(DDR) is supported.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval true DTR clocking supported.
 * @retval false DTR NOT supported.
 */
static inline bool SFDP_CheckDTRSupported(sfdp_handle_t *handle)
{
    assert(handle != NULL);
    return (bool)((handle->bfp.dw1 & 0x80000UL) != 0UL);
}

/*!
 * @brief Get serial flash device's address mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return Serial flash device's address mode, in type of @ref sfdp_addr_mode_t.
 */
static inline sfdp_addr_mode_t SFDP_GetAddressBytes(sfdp_handle_t *handle)
{
    assert(handle != NULL);

    return (sfdp_addr_mode_t)((handle->bfp.dw1 & 0x60000UL) >> 17UL);
}

/*!
 * @brief Check if serial flash device support suspend operations.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval false Suspend operation not supported.
 * @retval true Suspend operation supported.
 */
static inline bool SFDP_CheckSuspendSupported(sfdp_handle_t *handle)
{
    return (bool)((handle->bfp.dw12 & (1UL << 31UL)) == 0UL);
}

/*!
 * @brief Check if serial flash device support deep power down operations.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval false Deep power down operation not supported.
 * @retval true Deep power down operation supported.
 */
static inline bool SFDP_CheckDeepPowerDownSupported(sfdp_handle_t *handle)
{
    return (bool)((handle->bfp.dw14 & (1UL << 31UL)) == 0UL);
}

/*!
 * @brief Get 4 byte address mode enter method, only workable when serial flash device support 4-byte
 * address mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return 4-byte address mode enter method of serial flash device, please refer to
 * @ref sfdp_4_byte_addr_enter_method_t for details.
 */
static inline sfdp_4_byte_addr_enter_method_t SFDP_Get4ByteAddrModeEnterMethod(sfdp_handle_t *handle)
{
    return (sfdp_4_byte_addr_enter_method_t)(uint32_t)((handle->bfp.dw16 & 0xFF000000UL) >> 24UL);
}

/*!
 * @brief Get 4 byte address mode exit method, only workable when serial flash device support 4-byte
 * address mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return 4-byte address mode exit method of serial flash device, please refer to
 * sfdp_4_byte_addr_exit_method_t for details.
 */
static inline sfdp_4_byte_addr_exit_method_t SFDP_Get4ByteAddrModeExitMethod(sfdp_handle_t *handle)
{
    return (sfdp_4_byte_addr_exit_method_t)(uint32_t)((handle->bfp.dw16 & 0xFFC000UL) >> 14UL);
}

/*!
 * @brief Get software reset method.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return Serial flash device software reset method, please refer to @ref sfdp_soft_reset_method_t for details.
 */
static inline sfdp_soft_reset_method_t SFDP_GetSoftResetMethod(sfdp_handle_t *handle)
{
    return (sfdp_soft_reset_method_t)((handle->bfp.dw16 & 0x3F00UL) >> 8UL);
}

/* @} */

/*!
 * @name Get QPI Attributes
 * @{
 */

/*!
 * @brief Get supported method to enable 1s-1s-4s and 1s-4s-4s mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash device supported quad enable method, please refer to @ref sfdp_quad_enable_method_t for
 * details.
 */
static inline sfdp_quad_enable_method_t SFDP_GetQuadEnableMethod(sfdp_handle_t *handle)
{
    return (sfdp_quad_enable_method_t)((handle->bfp.dw15 & 0x700000UL) >> 20UL);
}

/*!
 * @brief Check if serial flash device support 0-4-4 mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval false Current serial flash device do not support 0-4-4 mode.
 * @retval true Current serial flash device support 0-4-4 mode.
 */
static inline bool SFDP_Check044ModeSupported(sfdp_handle_t *handle)
{
    return ((handle->bfp.dw15 & 0x200UL) != 0UL);
}

/*!
 * @brief Get supported method to entry 0-4-4 mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash device supported method to enter 0-4-4 mode, please refer to
 * @ref sfdp_044_mode_entry_method_t for details.
 */
static inline sfdp_044_mode_entry_method_t SFDP_Get044ModeEntryMethod(sfdp_handle_t *handle)
{
    return (sfdp_044_mode_entry_method_t)((handle->bfp.dw15 & 0xF0000UL) >> 16UL);
}

/*!
 * @brief Get support method to exit 0-4-4 mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash device supported method to exit 0-4-4 mode, please refer to
 * @ref sfdp_044_mode_exit_method_t for details.
 */
static inline sfdp_044_mode_exit_method_t SFDP_Get044ModeExitMethod(sfdp_handle_t *handle)
{
    return (sfdp_044_mode_exit_method_t)((handle->bfp.dw15 & 0xFC00UL) >> 10U);
}

/*!
 * @brief Get supported method to enable 4s-4s-4s mode from 1s-1s-1s mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash device supported method to enable 4s-4s-4s mode, please refer to
 * @ref sfdp_4s4s4s_mode_enable_method_t for details.
 */
static inline sfdp_4s4s4s_mode_enable_method_t SFDP_Get4s4s4sModeEnableMethod(sfdp_handle_t *handle)
{
    return (sfdp_4s4s4s_mode_enable_method_t)((handle->bfp.dw15 & 0x1F0UL) >> 4U);
}

/*!
 * @brief Get supported method to disable 4s-4s-4s mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash device supported method to disable 4s-4s-4s mode, please refer to
 * @ref sfdp_4s4s4s_mode_disable_method_t for details.
 */
static inline sfdp_4s4s4s_mode_disable_method_t SFDP_Get4s4s4sModeDisableMethod(sfdp_handle_t *handle)
{
    if (SFDP_Get4s4s4sModeEnableMethod(handle) == kSFDP_4s4s4sModeEnableMethod4)
    {
        return kSFDP_4s4s4sModeDisableMethod4;
    }
    else
    {
        return (sfdp_4s4s4s_mode_disable_method_t)(handle->bfp.dw15 & 0xFUL);
    }
}

/*!
 * @brief Get sequence to entry 4s-4d-4d mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrEntrySe The parameter to store sequences to enter 4s-4d-4d mode,
                        in type of @ref sfdp_4s4d4d_entry_seq_t.
 *
 * @retval kSFDP_RET_Success Successfully to get 4s-4d-4d entry sequence.
 * @retval kSFDP_RET_NotImplemented Current serial flash device does not support 4s-4d-4d entry sequence.
 */
sfdp_ret_type_t SFDP_Get4s4d4dEntrySeq(sfdp_handle_t *handle, sfdp_4s4d4d_entry_seq_t *ptrEntrySeq);

/*!
 * @brief Check if Data strobe supported in Quad SPI DTR(DDR) mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval false Data strobe not supported in Quad SPI DTR mode.
 * @retval true  Data strobe supported in Quad SPI DTR mode.
 */
static inline bool SFDP_CheckDSSupportedForQpiDtrMode(sfdp_handle_t *handle)
{
    return (bool)((handle->bfp.dw18 & (1UL << 27UL)) != 0UL);
}

/*!
 * @brief Check if data strobe supported in Quad SPI STR(SDR) mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval false Data strobe not supported in Quad SPI STR mode.
 * @retval true Data strobe supported in Quad SPI STR mode.
 */
static inline bool SFDP_CheckDSSupportedForQpiStrMode(sfdp_handle_t *handle)
{
    return (bool)((handle->bfp.dw18 & (1UL << 26UL)) != 0UL);
}

/* @} */

/*!
 * @name Get OPI Attributes
 * @{
 */

/*!
 * @brief Get octal DTR(DDR)(also called 8d-8d-8d) command type.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return The serial flash supported octal dtr cmd type, please refer to @ref sfdp_octal_dtr_cmd_type_t for details.
 */
static inline sfdp_octal_dtr_cmd_type_t SFDP_GetOctalDTRCmdType(sfdp_handle_t *handle)
{
    return (sfdp_octal_dtr_cmd_type_t)((handle->bfp.dw18 & 0x60000000UL) >> 29UL);
}

/*!
 * @brief Check if byte order is swapped in 8D-8D-8D mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval true Byte order is swapped.
 * @retval false Byte order is not swapped.
 */
static inline bool SFDP_CheckByteSwapInOctalMode(sfdp_handle_t *handle)
{
    assert(handle->curJEDECVersion >= kSFDP_JESD216A);

    return (bool)((handle->bfp.dw18 & 0x80000000UL) != 0UL);
}

/*!
 * @brief Get command extension of input command.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] cmd The octal command used to calculate command extension.
 *
 * @return The command extension based on current serial flash device's command policy.
 */
uint8_t SFDP_GetOctalDTRCmdExtension(sfdp_handle_t *handle, uint8_t cmd);

/*!
 * @brief Check if current serial flash device support input OPI(octal spi) command.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param opiCmd The input octal spi command to check.
 *
 * @retval kSFDP_RET_OPICMDNotSupported The input opi command not supported.
 * @retval kSFDP_RET_Success The input opi command supported.
 */
sfdp_ret_type_t SFDP_CheckOPICmdSupported(sfdp_handle_t *handle, sfdp_xspi_profile_opi_cmd_t opiCmd);

/*!
 * @brief Used to enable 1s-1s-8s and 1s-8s-8s octal read or octal program operations.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash device supported octal enable method, please refer to @ref sfdp_octal_enable_method_t
 * for details.
 */
static inline sfdp_octal_enable_method_t SFDP_GetOctalEnableMethod(sfdp_handle_t *handle)
{
    return (sfdp_octal_enable_method_t)((handle->bfp.dw19 & 0x700000UL) >> 20UL);
}

/*!
 * @brief Check if current serial flash device support 0-8-8 mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @retval false Current serial flash device does not support 0-8-8 mode.
 * @retval true Current serial flash device supports 0-8-8 mode.
 */
static inline bool SFDP_Check088ModeSupported(sfdp_handle_t *handle)
{
    return (bool)((handle->bfp.dw19 & (1UL << 9UL)) != 0UL);
}

/*!
 * @brief Get 0-8-8 mode entry method.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return The serial flash device supported 0-8-8 mode entry method,
 * please refer to @ref sfdp_088_mode_entry_method_t.
 */
static inline sfdp_088_mode_entry_method_t SFDP_Get088ModeEntryMethod(sfdp_handle_t *handle)
{
    return (sfdp_088_mode_entry_method_t)((handle->bfp.dw19 & 0xF0000UL) >> 16UL);
}

/*!
 * @brief Get 0-8-8 mode exit method.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return The serial flash device supported 0-8-8 mode exit method,
 * please refer to @ref sfdp_088_mode_exit_method_t.
 */
static inline sfdp_088_mode_exit_method_t SFDP_Get088ModeExitMethod(sfdp_handle_t *handle)
{
    return (sfdp_088_mode_exit_method_t)((handle->bfp.dw19 & 0xFC00UL) >> 10UL);
}

/*!
 * @brief Get supported method to enter 8s-8s-8s mode from 1s-1s-1s mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash supported method to enter 8s-8s-8s mode,
 * please refer to @ref sfdp_8s8s8s_mode_enable_method_t for details.
 */
static inline sfdp_8s8s8s_mode_enable_method_t SFDP_Get8s8s8sModeEnableMethod(sfdp_handle_t *handle)
{
    return (sfdp_8s8s8s_mode_enable_method_t)((handle->bfp.dw19 & 0x1F0UL) >> 4UL);
}

/*!
 * @brief Get supported method to exit 8s-8s-8s mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @return The serial flash supported method to exit 8s-8s-8s mode, please refer to
 * @ref sfdp_8s8s8s_mode_disable_method_t for details.
 */
static inline sfdp_8s8s8s_mode_disable_method_t SFDP_Get8s8s8sModeDisableMethod(sfdp_handle_t *handle)
{
    return (sfdp_8s8s8s_mode_disable_method_t)(handle->bfp.dw19 & 0xFUL);
}

/*!
 * @brief Get 8d-8d-8d(octal DTR) mode entry sequences.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrEntrySeq The variable to store sequences to enter 8d-8d-8d mode.
 *
 * @retval kSFDP_RET_Success Successfully to get sequences to enter 8d-8d-8d mode.
 * @retval kSFDP_RET_NotImplemented Current serial flash device do not support sequences to enter 8d-8d-8d mode.
 */
sfdp_ret_type_t SFDP_Get8d8d8dEntrySeq(sfdp_handle_t *handle, sfdp_8d8d8d_entry_seq_t *ptrEntrySeq);
/*! @} */

/*!
 * @name Get Device's Commands
 * @{
 */

/*!
 * @brief Get erase suspend/resume command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrEraseSuspendResumeCmdInfo The variable to store erase suspend/resume command information, please
 *                                          refer to @ref sfdp_erase_suspend_resume_cmd_info_t for details.
 */
void SFDP_GetEraseSuspendResumeCmdInfo(sfdp_handle_t *handle,
                                       sfdp_erase_suspend_resume_cmd_info_t *ptrEraseSuspendResumeCmdInfo);

/*!
 * @brief Get program suspend/resume command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrProgramSuspendResumeCmdInfo The variable to store program suspend/resume command information,
 * please refer to @ref sfdp_program_suspend_cmd_info_t for details.
 */
void SFDP_GetProgramSuspendResumeCmdInfo(sfdp_handle_t *handle,
                                         sfdp_program_suspend_cmd_info_t *ptrProgramSuspendResumeCmdInfo);

/*!
 * @brief Get deep power down command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrDeepPowerDownCmdInfo The variable to store deep power down command information, please refer to
 * @ref sfdp_deep_power_down_cmd_info_t for details.
 */
void SFDP_GetDeepPowerDownCmdInfo(sfdp_handle_t *handle, sfdp_deep_power_down_cmd_info_t *ptrDeepPowerDownCmdInfo);

/*!
 * @brief Get read command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType The protocol type for current serial flash device.
 * @param[in] clkFreq The frequency of serial clock.
 * @param[out] ptrReadCmdInfo The variable of store read command information,
 *                          please refer to @ref sfdp_read_cmd_info_t for details.
 */
void SFDP_GetReadCmdInfo(sfdp_handle_t *handle,
                         sfdp_protocol_type_t protocolType,
                         uint32_t clkFreq,
                         sfdp_read_cmd_info_t *ptrReadCmdInfo);

/*!
 * @brief Get chip erase information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrChipEraseCmdInfo The variable to store chip erase command information,
 *                                  please refer to @ref sfdp_chip_erase_cmd_info_t for details.
 */
void SFDP_GetChipEraseCmdInfo(sfdp_handle_t *handle, sfdp_chip_erase_cmd_info_t *ptrChipEraseCmdInfo);

/*!
 * @brief Get sector erase command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] type Used to select erase command type, please refer to @ref sfdp_erase_cmd_type_t.
 * @param[out] ptrEraseCmdInfo The variable to store erase command information,
                                please refer to @ref sfdp_erase_cmd_info_t for details.
 *
 * @retval kSFDP_RET_EraseCMDNotSupported Selected type of erase command not supported.
 * @retval kSFDP_RET_Success Successfully to get selected erase command information.
 */
sfdp_ret_type_t SFDP_GetSectorEraseCmdInfo(sfdp_handle_t *handle,
                                           sfdp_erase_cmd_type_t type,
                                           sfdp_erase_cmd_info_t *ptrEraseCmdInfo);

/*!
 * @brief Get page program command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType The protocol type for current serial flash device.
 * @param[out] ptrPageProgramCmdInfo The variable to store page program command information,
 *                                  please refer to @ref sfdp_page_program_cmd_info_t.
 */
void SFDP_GetPageProgramCmdInfo(sfdp_handle_t *handle,
                                sfdp_protocol_type_t protocolType,
                                sfdp_page_program_cmd_info_t *ptrPageProgramCmdInfo);

/*!
 * @brief Get read status command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType The protocol type for current serial flash device.
 * @param[out] ptrReadStatusCmdInfo The variable to store read status command information,
 *                              please refer to @ref sfdp_read_status_cmd_info_t.
 */
void SFDP_GetReadStatusCmdInfo(sfdp_handle_t *handle,
                               sfdp_protocol_type_t protocolType,
                               sfdp_read_status_cmd_info_t *ptrReadStatusCmdInfo);

/*!
 * @brief Get write status command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrWriteStatusCmdInfo The variable to stor write status command information,
 *                                  please refer to @ref sfdp_write_status_cmd_info_t.
 */
void SFDP_GetWriteStatusCmdInfo(sfdp_handle_t *handle, sfdp_write_status_cmd_info_t *ptrWriteStatusCmdInfo);

/* @} */

/*!
 * @name Get Device register bit field information
 * @{
 */

/*!
 * @brief Get busy bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] padNum Number of data pad.
 * @param[out] ptrBusyBitInfo The variable to store busy bit information.
 *
 * @retval kSFDP_RET_Success Successfully to get busy bit field information.
 */
sfdp_ret_type_t SFDP_GetBusyBitInfo(sfdp_handle_t *handle,
                                    sfdp_flash_pad_num_t padNum,
                                    sfdp_wip_bit_info_t *ptrBusyBitInfo);

/*!
 * @brief Get WEL(write enable) bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Current selected protocol type.
 * @param[out] ptrWelBitInfo The variable to store WEL bit information.
 *
 * @retval kSFDP_RET_Success Successfully to get WEL bit field information.
 */
sfdp_ret_type_t SFDP_GetWELBitInfo(sfdp_handle_t *handle,
                                   sfdp_protocol_type_t protocolType,
                                   sfdp_wel_bit_info_t *ptrWelBitInfo);

/*!
 * @brief Get program error bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Specify the protocol type to use.
 * @param[out] ptrProgramErrorBitInfo The variable to store program error bit information.
 *
 * @retval kSFDP_RET_NotImplemented Current serial flash do not implement the parameter table.
 * @retval kSFDP_RET_RegBitNotSupported Current serial flash do not support program error bit.
 * @retval kSFDP_RET_Success Successfully to get program error bit field information.
 */
sfdp_ret_type_t SFDP_GetProgramErrorBitInfo(sfdp_handle_t *handle,
                                            sfdp_protocol_type_t protocolType,
                                            sfdp_program_error_bit_info_t *ptrProgramErrorBitInfo);

/*!
 * @brief Get erase error bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Specify the protocol type to use.
 * @param[out] ptrEraseErrorBitInfo The variable to store erase error bit information.
 *
 * @retval kSFDP_RET_NotImplemented Current serial flash do not implement the parameter table.
 * @retval kSFDP_RET_RegBitNotSupported Current serial flash do not support erase error bit.
 * @retval kSFDP_RET_Success Successfully to get erase error bit field information.
 */
sfdp_ret_type_t SFDP_GetEraseErrorBitInfo(sfdp_handle_t *handle,
                                          sfdp_protocol_type_t protocolType,
                                          sfdp_erase_error_bit_info_t *ptrEraseErrorBitInfo);

/*!
 * @brief Get variable dummy cycle information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Specify the protocol type to use.
 * @param[out] ptrVariableDCInfo The variable to updated dummy cycle value..
 *
 * @retval kSFDP_RET_NotImplemented Current serial flash do not implement the parameter table.
 * @retval kSFDP_RET_RegBitNotSupported Current serial flash do not support variable dummy cycle bit.
 * @retval kSFDP_RET_Success Successfully to get variable dummy cycle bit field information.
 */
sfdp_ret_type_t SFDP_GetVolatileVariableDummyCycleInfo(sfdp_handle_t *handle,
                                                       sfdp_protocol_type_t protocolType,
                                                       sfdp_variable_dummy_cycle_t *ptrVariableDCInfo);
/* @} */

#if defined(__cplusplus)
extern "C" {
#endif

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* __FSL_SFDP_H */
